In [41]:
import pandas as pd
import sqlite3

customers = pd.read_csv("/kaggle/input/day21-datasets/day_21_customers.csv")
purchases = pd.read_csv("/kaggle/input/day21-datasets/day_21_purchases.csv")

conn = sqlite3.connect(":memory:")

customers.to_sql("customers", conn, index=False, if_exists="replace")
purchases.to_sql("purchases", conn, index=False, if_exists="replace")

30

In [42]:
def run(query):
    return pd.read_sql(query, conn)
    
run("SELECT * FROM customers LIMIT 5;")

,customer_id,name,city,age,hair_type,scalp_type,acquisition_channel
0,1,Aanya,Delhi,23,Curly,Oily,Instagram
1,2,Meera,Mumbai,26,Wavy,Dry,YouTube
2,3,Ritika,Bangalore,24,Straight,Normal,Friend Referral
3,4,Pooja,Pune,28,Curly,Dry,Instagram
4,5,Sneha,Delhi,22,Wavy,Oily,College Event

In [43]:
def run(query):
    return pd.read_sql(query, conn)

run("SELECT * FROM purchases LIMIT 5;")

,purchase_id,customer_id,product,category,amount,purchase_date
0,101,1,Curl Defining Cream,Styling,899,2024-01-05
1,102,1,Hydrating Shampoo,Shampoo,499,2024-02-12
2,103,2,Argan Hair Mask,Treatment,999,2024-01-15
3,104,3,Anti-Dandruff Shampoo,Shampoo,599,2024-02-01
4,105,4,Leave-In Conditioner,Conditioner,699,2024-03-10

customers(customer_id, name, city, age, hair_type, scalp_type, acquisition_channel)

purchases(purchase_id, customer_id, product, category, amount, purchase_date)

# ðŸŸ¢ EASY LEVEL (Foundations + JOIN + GROUP BY)

**Show all customers and their cities.**

In [44]:
pd.read_sql("""
SELECT name, city
FROM customers
; 
""", conn)

       name        city
0     Aanya       Delhi
1     Meera      Mumbai
2    Ritika   Bangalore
3     Pooja        Pune
4     Sneha       Delhi
5     Kriti      Jaipur
6     Nisha     Chennai
7     Tanya      Mumbai
8      Riya     Kolkata
9    Ishita       Delhi
10   Anjali      Indore
11   Simran  Chandigarh
12    Kavya   Bangalore
13     Neha        Pune
14   Sakshi      Mumbai
15   Rashmi       Delhi
16    Priya     Lucknow
17  Shalini      Bhopal
18   Monika       Delhi
19    Aditi      Mumbai

**Show all purchases where amount > 700.**

In [45]:
pd.read_sql("""
SELECT *
FROM purchases
WHERE amount > 700
; 
""", conn)

,purchase_id,customer_id,product,category,amount,purchase_date
0,101,1,Curl Defining Cream,Styling,899,2024-01-05
1,103,2,Argan Hair Mask,Treatment,999,2024-01-15
2,107,6,Protein Hair Mask,Treatment,1099,2024-02-18
3,109,8,Heat Protectant Spray,Styling,799,2024-02-14
4,112,11,Scalp Scrub,Treatment,899,2024-02-25
5,114,13,Repair Hair Mask,Treatment,1199,2024-01-18
6,117,16,Curl Defining Cream,Styling,899,2024-02-03
7,120,19,Deep Repair Mask,Treatment,1299,2024-03-15
8,122,2,Heat Protectant Spray,Styling,799,2024-03-18
9,124,6,Argan Conditioner,Conditioner,749,2024-03-07
10,125,8,Protein Hair Mask,Treatment,1099,2024-01-19
11,126,10,Scalp Scrub,Treatment,899,2024-02-09

**Show customer names with their purchased product (INNER JOIN).**

In [46]:
pd.read_sql("""
SELECT name, product
FROM customers c
INNER JOIN purchases p
ON c.customer_id = p.customer_id 
; 
""", conn)

       name                product
0     Aanya    Curl Defining Cream
1     Aanya      Hydrating Shampoo
2     Meera        Argan Hair Mask
3     Meera  Heat Protectant Spray
4    Ritika  Anti-Dandruff Shampoo
5     Pooja             Hair Serum
6     Pooja   Leave-In Conditioner
7     Sneha             Hair Serum
8     Kriti      Argan Conditioner
9     Kriti      Protein Hair Mask
10    Nisha     Clarifying Shampoo
11    Nisha               Hair Oil
12    Tanya  Heat Protectant Spray
13    Tanya      Protein Hair Mask
14     Riya   Moisture Conditioner
15   Ishita               Curl Gel
16   Ishita            Scalp Scrub
17   Anjali            Scalp Scrub
18   Simran      Smoothing Shampoo
19    Kavya       Repair Hair Mask
20     Neha               Curl Gel
21     Neha      Light Conditioner
22   Sakshi               Hair Oil
23   Rashmi    Curl Defining Cream
24   Rashmi      Hydrating Shampoo
25    Priya     Volumizing Shampoo
26  Shalini       Anti-Frizz Serum
27   Monika       Deep Repair Mask
28   Monika   Leave-In Conditioner
29    Aditi         Herbal Shampoo

**Show total spending per customer.**

In [47]:
pd.read_sql("""
SELECT name, SUM(amount) AS total_spending 
FROM customers c
INNER JOIN purchases p
ON c.customer_id = p.customer_id 
GROUP BY name
; 
""", conn)

       name  total_spending
0     Aanya            1398
1     Aditi             499
2    Anjali             899
3    Ishita            1398
4     Kavya            1199
5     Kriti            1848
6     Meera            1798
7    Monika            1998
8      Neha            1048
9     Nisha             948
10    Pooja            1098
11    Priya             649
12   Rashmi            1398
13   Ritika             599
14     Riya             649
15   Sakshi             399
16  Shalini             699
17   Simran             599
18    Sneha             399
19    Tanya            1898

**Show number of purchases per category.**

In [48]:
pd.read_sql("""
SELECT category, COUNT(*) AS total_purchases
FROM customers c
INNER JOIN purchases p
ON c.customer_id = p.customer_id 
GROUP BY category
; 
""", conn)

      category  total_purchases
0  Conditioner                5
1      Shampoo                7
2      Styling                9
3    Treatment                9

**Show total revenue per city.**

In [49]:
pd.read_sql("""
SELECT city, SUM(amount) as total_revenue
FROM customers c
INNER JOIN purchases p
ON c.customer_id = p.customer_id 
GROUP BY city
; 
""", conn)

          city  total_revenue
0    Bangalore           1798
1       Bhopal            699
2   Chandigarh            599
3      Chennai            948
4        Delhi           6591
5       Indore            899
6       Jaipur           1848
7      Kolkata            649
8      Lucknow            649
9       Mumbai           4594
10        Pune           2146

**Show customers who belong to the "Curly" hair_type.**

In [50]:
pd.read_sql("""
SELECT name, hair_type
FROM customers
WHERE hair_type = 'Curly'
; 
""", conn)

     name hair_type
0   Aanya     Curly
1   Pooja     Curly
2   Nisha     Curly
3  Ishita     Curly
4   Kavya     Curly
5  Rashmi     Curly
6  Monika     Curly

**Show all purchases made in February.**

In [51]:
pd.read_sql("""
SELECT *
FROM purchases
WHERE purchase_date LIKE '2024-02%';
 
""", conn)

,purchase_id,customer_id,product,category,amount,purchase_date
0,102,1,Hydrating Shampoo,Shampoo,499,2024-02-12
1,104,3,Anti-Dandruff Shampoo,Shampoo,599,2024-02-01
2,107,6,Protein Hair Mask,Treatment,1099,2024-02-18
3,109,8,Heat Protectant Spray,Styling,799,2024-02-14
4,112,11,Scalp Scrub,Treatment,899,2024-02-25
5,115,14,Light Conditioner,Conditioner,549,2024-02-07
6,117,16,Curl Defining Cream,Styling,899,2024-02-03
7,119,18,Anti-Frizz Serum,Styling,699,2024-02-20
8,126,10,Scalp Scrub,Treatment,899,2024-02-09
9,129,19,Leave-In Conditioner,Conditioner,699,2024-02-28

**Show average purchase amount per category.**

In [52]:
pd.read_sql("""
SELECT category, AVG(amount) AS avg_amount
FROM purchases
GROUP BY category;
""", conn)

      category  avg_amount
0  Conditioner  669.000000
1      Shampoo  556.142857
2      Styling  654.555556
3    Treatment  921.222222

**Customers acquired from Instagram**

In [53]:
pd.read_sql("""
SELECT *
FROM customers
WHERE acquisition_channel = 'Instagram';
""", conn)

   customer_id    name     city  age hair_type scalp_type acquisition_channel
0            1   Aanya    Delhi   23     Curly       Oily           Instagram
1            4   Pooja     Pune   28     Curly        Dry           Instagram
2            7   Nisha  Chennai   27     Curly       Oily           Instagram
3            9    Riya  Kolkata   21  Straight        Dry           Instagram
4           11  Anjali   Indore   24      Wavy       Oily           Instagram
5           14    Neha     Pune   31      Wavy     Normal           Instagram
6           16  Rashmi    Delhi   27     Curly        Dry           Instagram
7           20   Aditi   Mumbai   22      Wavy     Normal           Instagram

# ðŸŸ¡ MEDIUM LEVEL (CASE, Subqueries, Window Basics, Aggregation Logic)

**Label each purchase as:
"Expensive" if amount â‰¥ 900
"Affordable" otherwise**

In [54]:
pd.read_sql("""
SELECT purchase_id, product, amount, CASE
    WHEN amount >= 900 THEN "Expensive"
    ELSE "Affordable"
    END AS purchase_type
FROM purchases;
 
""", conn)

    purchase_id                product  amount purchase_type
0           101    Curl Defining Cream     899    Affordable
1           102      Hydrating Shampoo     499    Affordable
2           103        Argan Hair Mask     999     Expensive
3           104  Anti-Dandruff Shampoo     599    Affordable
4           105   Leave-In Conditioner     699    Affordable
5           106             Hair Serum     399    Affordable
6           107      Protein Hair Mask    1099     Expensive
7           108     Clarifying Shampoo     549    Affordable
8           109  Heat Protectant Spray     799    Affordable
9           110   Moisture Conditioner     649    Affordable
10          111               Curl Gel     499    Affordable
11          112            Scalp Scrub     899    Affordable
12          113      Smoothing Shampoo     599    Affordable
13          114       Repair Hair Mask    1199     Expensive
14          115      Light Conditioner     549    Affordable
15          116               Hair Oil     399    Affordable
16          117    Curl Defining Cream     899    Affordable
17          118     Volumizing Shampoo     649    Affordable
18          119       Anti-Frizz Serum     699    Affordable
19          120       Deep Repair Mask    1299     Expensive
20          121         Herbal Shampoo     499    Affordable
21          122  Heat Protectant Spray     799    Affordable
22          123             Hair Serum     399    Affordable
23          124      Argan Conditioner     749    Affordable
24          125      Protein Hair Mask    1099     Expensive
25          126            Scalp Scrub     899    Affordable
26          127               Curl Gel     499    Affordable
27          128      Hydrating Shampoo     499    Affordable
28          129   Leave-In Conditioner     699    Affordable
29          130               Hair Oil     399    Affordable

**Show customers whose total spending is greater than average customer spending.**

In [55]:
pd.read_sql("""
SELECT customer_id, SUM(amount) AS total_spent
FROM purchases
GROUP BY customer_id
HAVING SUM(amount) >
(
  SELECT AVG(total)
  FROM (
    SELECT SUM(amount) AS total
    FROM purchases
    GROUP BY customer_id
  )
);

""", conn)

   customer_id  total_spent
0            1         1398
1            2         1798
2            4         1098
3            6         1848
4            8         1898
5           10         1398
6           13         1199
7           16         1398
8           19         1998

**Show category-wise revenue and classify:
"Top Category" if revenue â‰¥ overall average revenue
"Low Category" otherwise**

In [56]:
pd.read_sql("""
SELECT category, total_revenue,
CASE
  WHEN total_revenue >= avg_rev THEN 'Top Category'
  ELSE 'Low Category'
END AS label
FROM (
  SELECT category,
         SUM(amount) AS total_revenue,
         AVG(SUM(amount)) OVER () AS avg_rev
  FROM purchases
  GROUP BY category
);

""", conn)

      category  total_revenue         label
0  Conditioner           3345  Low Category
1      Shampoo           3893  Low Category
2      Styling           5891  Top Category
3    Treatment           8291  Top Category

**Show each purchase along with the customer's city.**

In [57]:
pd.read_sql("""
SELECT p.*, c.city
FROM purchases p
JOIN customers c
ON p.customer_id = c.customer_id;

 
""", conn)

,purchase_id,customer_id,product,category,amount,purchase_date,city
0,101,1,Curl Defining Cream,Styling,899,2024-01-05,Delhi
1,102,1,Hydrating Shampoo,Shampoo,499,2024-02-12,Delhi
2,103,2,Argan Hair Mask,Treatment,999,2024-01-15,Mumbai
3,104,3,Anti-Dandruff Shampoo,Shampoo,599,2024-02-01,Bangalore
4,105,4,Leave-In Conditioner,Conditioner,699,2024-03-10,Pune
5,106,5,Hair Serum,Styling,399,2024-01-22,Delhi
6,107,6,Protein Hair Mask,Treatment,1099,2024-02-18,Jaipur
7,108,7,Clarifying Shampoo,Shampoo,549,2024-03-02,Chennai
8,109,8,Heat Protectant Spray,Styling,799,2024-02-14,Mumbai
9,110,9,Moisture Conditioner,Conditioner,649,2024-01-30,Kolkata
10,111,10,Curl Gel,Styling,499,2024-03-05,Delhi
11,112,11,Scalp Scrub,Treatment,899,2024-02-25,Indore
12,113,12,Smoothing Shampoo,Shampoo,599,2024-03-11,Chandigarh
13,114,13,Repair Hair Mask,Treatment,1199,2024-01-18,Bangalore
14,115,14,Light Conditioner,Conditioner,549,2024-02-07,Pune
15,116,15,Hair Oil,Treatment,399,2024-03-21,Mumbai
16,117,16,Curl Defining Cream,Styling,899,2024-02-03,Delhi
17,118,17,Volumizing Shampoo,Shampoo,649,2024-01-27,Lucknow
18,119,18,Anti-Frizz Serum,Styling,699,2024-02-20,Bhopal
19,120,19,Deep Repair Mask,Treatment,1299,2024-03-15,Delhi
20,121,20,Herbal Shampoo,Shampoo,499,2024-01-09,Mumbai
21,122,2,Heat Protectant Spray,Styling,799,2024-03-18,Mumbai
22,123,4,Hair Serum,Styling,399,2024-01-11,Pune
23,124,6,Argan Conditioner,Conditioner,749,2024-03-07,Jaipur
24,125,8,Protein Hair Mask,Treatment,1099,2024-01-19,Mumbai
25,126,10,Scalp Scrub,Treatment,899,2024-02-09,Delhi
26,127,14,Curl Gel,Styling,499,2024-03-25,Pune
27,128,16,Hydrating Shampoo,Shampoo,499,2024-01-16,Delhi
28,129,19,Leave-In Conditioner,Conditioner,699,2024-02-28,Delhi
29,130,7,Hair Oil,Treatment,399,2024-01-04,Chennai

**Customers with more than one purchase**

In [58]:
pd.read_sql("""
SELECT customer_id, product
FROM purchases
GROUP BY customer_id
HAVING COUNT(*) > 1;
 
""", conn)

   customer_id                product
0            1    Curl Defining Cream
1            2        Argan Hair Mask
2            4   Leave-In Conditioner
3            6      Protein Hair Mask
4            7     Clarifying Shampoo
5            8  Heat Protectant Spray
6           10               Curl Gel
7           14      Light Conditioner
8           16    Curl Defining Cream
9           19       Deep Repair Mask

**Show top 3 most expensive purchases.**

In [59]:
pd.read_sql("""
SELECT *
FROM purchases
ORDER BY amount DESC
LIMIT 3;
 
""", conn)

,purchase_id,customer_id,product,category,amount,purchase_date
0,120,19,Deep Repair Mask,Treatment,1299,2024-03-15
1,114,13,Repair Hair Mask,Treatment,1199,2024-01-18
2,107,6,Protein Hair Mask,Treatment,1099,2024-02-18

**For each city, show total revenue.**

In [60]:
pd.read_sql("""
SELECT c.city, SUM(p.amount) AS revenue
FROM customers c
JOIN purchases p
ON c.customer_id = p.customer_id
GROUP BY c.city;

""", conn)

          city  revenue
0    Bangalore     1798
1       Bhopal      699
2   Chandigarh      599
3      Chennai      948
4        Delhi     6591
5       Indore      899
6       Jaipur     1848
7      Kolkata      649
8      Lucknow      649
9       Mumbai     4594
10        Pune     2146

**First purchase date per customer**

In [61]:
pd.read_sql("""
SELECT customer_id, MIN(purchase_date) AS first_purchase
FROM purchases
GROUP BY customer_id;
 
""", conn)

    customer_id first_purchase
0             1     2024-01-05
1             2     2024-01-15
2             3     2024-02-01
3             4     2024-01-11
4             5     2024-01-22
5             6     2024-02-18
6             7     2024-01-04
7             8     2024-01-19
8             9     2024-01-30
9            10     2024-02-09
10           11     2024-02-25
11           12     2024-03-11
12           13     2024-01-18
13           14     2024-02-07
14           15     2024-03-21
15           16     2024-01-16
16           17     2024-01-27
17           18     2024-02-20
18           19     2024-02-28
19           20     2024-01-09

**Show purchases that are higher than the customer's own average purchase amount.**

In [62]:
pd.read_sql("""
SELECT *
FROM (
  SELECT *,
         AVG(amount) OVER (PARTITION BY customer_id) AS avg_amt
  FROM purchases
)
WHERE amount > avg_amt;

""", conn)

,purchase_id,customer_id,product,category,amount,purchase_date,avg_amt
0,101,1,Curl Defining Cream,Styling,899,2024-01-05,699.0
1,103,2,Argan Hair Mask,Treatment,999,2024-01-15,899.0
2,105,4,Leave-In Conditioner,Conditioner,699,2024-03-10,549.0
3,107,6,Protein Hair Mask,Treatment,1099,2024-02-18,924.0
4,108,7,Clarifying Shampoo,Shampoo,549,2024-03-02,474.0
5,125,8,Protein Hair Mask,Treatment,1099,2024-01-19,949.0
6,126,10,Scalp Scrub,Treatment,899,2024-02-09,699.0
7,115,14,Light Conditioner,Conditioner,549,2024-02-07,524.0
8,117,16,Curl Defining Cream,Styling,899,2024-02-03,699.0
9,120,19,Deep Repair Mask,Treatment,1299,2024-03-15,999.0

**Show percentage contribution of each category to total revenue.**

In [63]:
pd.read_sql("""
SELECT category,
       SUM(amount) * 100.0 / SUM(SUM(amount)) OVER () AS percent_contribution
FROM purchases
GROUP BY category;

""", conn)

      category  percent_contribution
0  Conditioner             15.616246
1      Shampoo             18.174603
2      Styling             27.502334
3    Treatment             38.706816

# ðŸ”´ HARD LEVEL (CTEs, Window Functions, Lead/Lag, Multi-step Logic)

**Rank customers by total spending (highest spender = rank 1).**

In [64]:
pd.read_sql("""
SELECT customer_id, total_spent,
       RANK() OVER (ORDER BY total_spent DESC) AS rank
FROM (
  SELECT customer_id, SUM(amount) AS total_spent
  FROM purchases
  GROUP BY customer_id
);
 
""", conn)

    customer_id  total_spent  rank
0            19         1998     1
1             8         1898     2
2             6         1848     3
3             2         1798     4
4             1         1398     5
5            10         1398     5
6            16         1398     5
7            13         1199     8
8             4         1098     9
9            14         1048    10
10            7          948    11
11           11          899    12
12           18          699    13
13            9          649    14
14           17          649    14
15            3          599    16
16           12          599    16
17           20          499    18
18            5          399    19
19           15          399    19

**Rank customers by total spending (highest spender = rank 1).**

In [65]:
pd.read_sql("""
SELECT *
FROM (
  SELECT c.city, c.name,
         SUM(p.amount) AS total_spent,
         RANK() OVER (
           PARTITION BY c.city
           ORDER BY SUM(p.amount) DESC
         ) AS rnk
  FROM customers c
  JOIN purchases p
  ON c.customer_id = p.customer_id
  GROUP BY c.city, c.name
)
WHERE rnk <= 2;

 
""", conn)

          city     name  total_spent  rnk
0    Bangalore    Kavya         1199    1
1    Bangalore   Ritika          599    2
2       Bhopal  Shalini          699    1
3   Chandigarh   Simran          599    1
4      Chennai    Nisha          948    1
5        Delhi   Monika         1998    1
6        Delhi   Rashmi         1398    2
7        Delhi   Ishita         1398    2
8        Delhi    Aanya         1398    2
9       Indore   Anjali          899    1
10      Jaipur    Kriti         1848    1
11     Kolkata     Riya          649    1
12     Lucknow    Priya          649    1
13      Mumbai    Tanya         1898    1
14      Mumbai    Meera         1798    2
15        Pune    Pooja         1098    1
16        Pune     Neha         1048    2

**Show running total spending per customer ordered by purchase_date.**

In [66]:
pd.read_sql("""
SELECT customer_id, purchase_date, amount,
       SUM(amount) OVER (
         PARTITION BY customer_id
         ORDER BY purchase_date
       ) AS running_total
FROM purchases;
 
""", conn)

    customer_id purchase_date  amount  running_total
0             1    2024-01-05     899            899
1             1    2024-02-12     499           1398
2             2    2024-01-15     999            999
3             2    2024-03-18     799           1798
4             3    2024-02-01     599            599
5             4    2024-01-11     399            399
6             4    2024-03-10     699           1098
7             5    2024-01-22     399            399
8             6    2024-02-18    1099           1099
9             6    2024-03-07     749           1848
10            7    2024-01-04     399            399
11            7    2024-03-02     549            948
12            8    2024-01-19    1099           1099
13            8    2024-02-14     799           1898
14            9    2024-01-30     649            649
15           10    2024-02-09     899            899
16           10    2024-03-05     499           1398
17           11    2024-02-25     899            899
18           12    2024-03-11     599            599
19           13    2024-01-18    1199           1199
20           14    2024-02-07     549            549
21           14    2024-03-25     499           1048
22           15    2024-03-21     399            399
23           16    2024-01-16     499            499
24           16    2024-02-03     899           1398
25           17    2024-01-27     649            649
26           18    2024-02-20     699            699
27           19    2024-02-28     699            699
28           19    2024-03-15    1299           1998
29           20    2024-01-09     499            499

**Show running total spending per customer.**

In [67]:
pd.read_sql("""
SELECT customer_id, purchase_date, amount,
       SUM(amount) OVER (
         PARTITION BY customer_id
         ORDER BY purchase_date
       ) AS running_total
FROM purchases;
 
""", conn)

    customer_id purchase_date  amount  running_total
0             1    2024-01-05     899            899
1             1    2024-02-12     499           1398
2             2    2024-01-15     999            999
3             2    2024-03-18     799           1798
4             3    2024-02-01     599            599
5             4    2024-01-11     399            399
6             4    2024-03-10     699           1098
7             5    2024-01-22     399            399
8             6    2024-02-18    1099           1099
9             6    2024-03-07     749           1848
10            7    2024-01-04     399            399
11            7    2024-03-02     549            948
12            8    2024-01-19    1099           1099
13            8    2024-02-14     799           1898
14            9    2024-01-30     649            649
15           10    2024-02-09     899            899
16           10    2024-03-05     499           1398
17           11    2024-02-25     899            899
18           12    2024-03-11     599            599
19           13    2024-01-18    1199           1199
20           14    2024-02-07     549            549
21           14    2024-03-25     499           1048
22           15    2024-03-21     399            399
23           16    2024-01-16     499            499
24           16    2024-02-03     899           1398
25           17    2024-01-27     649            649
26           18    2024-02-20     699            699
27           19    2024-02-28     699            699
28           19    2024-03-15    1299           1998
29           20    2024-01-09     499            499

**For each purchase, show current amount and previous purchase amount for that customer (use LAG).**

In [68]:
pd.read_sql("""
SELECT customer_id, purchase_date, amount,
       LAG(amount) OVER (
         PARTITION BY customer_id
         ORDER BY purchase_date
       ) AS previous_amount
FROM purchases;

""", conn)

    customer_id purchase_date  amount  previous_amount
0             1    2024-01-05     899              NaN
1             1    2024-02-12     499            899.0
2             2    2024-01-15     999              NaN
3             2    2024-03-18     799            999.0
4             3    2024-02-01     599              NaN
5             4    2024-01-11     399              NaN
6             4    2024-03-10     699            399.0
7             5    2024-01-22     399              NaN
8             6    2024-02-18    1099              NaN
9             6    2024-03-07     749           1099.0
10            7    2024-01-04     399              NaN
11            7    2024-03-02     549            399.0
12            8    2024-01-19    1099              NaN
13            8    2024-02-14     799           1099.0
14            9    2024-01-30     649              NaN
15           10    2024-02-09     899              NaN
16           10    2024-03-05     499            899.0
17           11    2024-02-25     899              NaN
18           12    2024-03-11     599              NaN
19           13    2024-01-18    1199              NaN
20           14    2024-02-07     549              NaN
21           14    2024-03-25     499            549.0
22           15    2024-03-21     399              NaN
23           16    2024-01-16     499              NaN
24           16    2024-02-03     899            499.0
25           17    2024-01-27     649              NaN
26           18    2024-02-20     699              NaN
27           19    2024-02-28     699              NaN
28           19    2024-03-15    1299            699.0
29           20    2024-01-09     499              NaN

**For each category, calculate month-wise revenue (use SUBSTR on purchase_date).**

In [69]:
pd.read_sql("""
WITH totals AS (
  SELECT customer_id, SUM(amount) AS total_spent
  FROM purchases
  GROUP BY customer_id
)
SELECT *
FROM totals
WHERE total_spent > 1500;

""", conn)

   customer_id  total_spent
0            2         1798
1            6         1848
2            8         1898
3           19         1998

**Show customers whose spending is above their cityâ€™s average spending.**

In [70]:
pd.read_sql("""
SELECT *
FROM (
  SELECT c.customer_id, c.city,
         SUM(p.amount) AS total_spent,
         AVG(SUM(p.amount)) OVER (PARTITION BY c.city) AS city_avg
  FROM customers c
  JOIN purchases p
  ON c.customer_id = p.customer_id
  GROUP BY c.customer_id, c.city
)
WHERE total_spent > city_avg;
 
""", conn)

   customer_id       city  total_spent  city_avg
0           13  Bangalore         1199     899.0
1            1      Delhi         1398    1318.2
2           10      Delhi         1398    1318.2
3           16      Delhi         1398    1318.2
4           19      Delhi         1998    1318.2
5            2     Mumbai         1798    1148.5
6            8     Mumbai         1898    1148.5
7            4       Pune         1098    1073.0

**Most purchased product per category**

In [71]:
pd.read_sql("""
SELECT category, product
FROM (
  SELECT category, product,
         COUNT(*) AS cnt,
         RANK() OVER (
           PARTITION BY category
           ORDER BY COUNT(*) DESC
         ) AS rnk
  FROM purchases
  GROUP BY category, product
)
WHERE rnk = 1;

""", conn)

      category                product
0  Conditioner   Leave-In Conditioner
1      Shampoo      Hydrating Shampoo
2      Styling  Heat Protectant Spray
3      Styling             Hair Serum
4      Styling               Curl Gel
5      Styling    Curl Defining Cream
6    Treatment            Scalp Scrub
7    Treatment      Protein Hair Mask
8    Treatment               Hair Oil

In [72]:
pd.read_sql("""
SELECT c.acquisition_channel,
       SUM(p.amount) * 100.0 / SUM(SUM(p.amount)) OVER () AS percent_contribution
FROM customers c
JOIN purchases p
ON c.customer_id = p.customer_id
GROUP BY c.acquisition_channel;

""", conn)

  acquisition_channel  percent_contribution
0       College Event              3.725490
1     Friend Referral             12.352941
2          Google Ads             14.687208
3           Instagram             37.054155
4             YouTube             32.180205

**Top 3 customers by lifetime value (CTE + window)**

In [73]:
pd.read_sql("""
WITH totals AS (
  SELECT customer_id, SUM(amount) AS total_spent
  FROM purchases
  GROUP BY customer_id
),
ranked AS (
  SELECT customer_id, total_spent,
         RANK() OVER (ORDER BY total_spent DESC) AS rnk
  FROM totals
)
SELECT *
FROM ranked
WHERE rnk <= 3;

""", conn)

   customer_id  total_spent  rnk
0           19         1998    1
1            8         1898    2
2            6         1848    3